# GBXMLImportOptions Class

---
Import options for Green-Building XML format.
SystemObject Autodesk.Revit.DBGBXMLImportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class GBXMLImportOptions

    Public Class GBXMLImportOptions

    public ref class GBXMLImportOptions

    type GBXMLImportOptions = class end
The GBXMLImportOptions type exposes the following members.
| Name| Description
---|---|---
| GBXMLImportOptions| Default constructor. Sets all options to their default values.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Not used currently. Reserved for future use.
#### Reference
Autodesk.Revit.DB Namespace